app/Models/InstitutModel.php

    public function verifier_nom($nom_inst){
        $builder = $this->db->table('institution');
        $builder->select('id_inst, nom_inst, email_inst, mot_passe');
        $builder->where('nom_inst',$nom_inst);
        $result = $builder->get();
---
SELECT `id_inst`, `nom_inst`, `email_inst`
FROM `institution`
WHERE `nom_inst` = 'rutwfjnewfj'